core/app/Modules/Hotels/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'nat@qlerqs.com'
 LIMIT 1
---
    public function loginSubmit()
    {
        $session = session();
        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();