core/app/Modules/Hotels/Controllers/HotelController.php

SELECT DISTINCT destinations.name, destinations.country_name
FROM `destinations`
WHERE   (
`destinations`.`name` LIKE '%ohte%' ESCAPE '!'
OR  `destinations`.`country_name` LIKE '%ohte%' ESCAPE '!'
 )
ORDER BY `destinations`.`country_name`
 LIMIT 20
---
    public function getCitySuggestions(): ResponseInterface
    {
        $term = $this->request->getGet('term');

        if (!$term || strlen($term) < 2) {
            return $this->response->setJSON([]);
        }

        $db = \Config\Database::connect();
        $hotelModel = new HotelModel();
        $suggestions = [];
        $uniqueKeys = [];

        $destBuilder = $db->table('destinations');
        $destBuilder->select('DISTINCT destinations.name, destinations.country_name', false)
                    ->groupStart()
                        ->like('destinations.name', $term)
                        ->orLike('destinations.country_name', $term)
                    ->groupEnd()
                    ->orderBy('destinations.country_name')
                    ->limit(20);
        $destinations = $destBuilder->get()->getResultArray();

SELECT *
FROM `hotels`
WHERE `name` LIKE '%ohte%' ESCAPE '!'
 LIMIT 20
---
            }
        }

        $hotels = $hotelModel->like('name', $term)
                           ->limit(20)
                           ->findAll();