core/app/Modules/Esim/Controllers/EsimController.php

SELECT *
FROM `markups`
WHERE `status` = 'enabled'
 LIMIT 1
---
    private function getB2CMarkup()
    {
        $markupModel = new MarkupModel();

        $markup = $markupModel->where('status', 'enabled')->first();